# CeilingAttrSystemnameParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CeilingAttrSystemnameParam Property
ParameterTypeId Class See Also
---
"System"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CeilingAttrSystemnameParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CeilingAttrSystemnameParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CeilingAttrSystemnameParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace